In [1]:
import pandas as pd

df = pd.read_csv('rides.csv')
df

        name  plate  distance
0      Gomez   1XZ2      3.70
1   Morticia    NaN      2.10
2     Fester             3.40
3      Lurch  Q38X3     -3.20
4        NaN    03A     14.30
5  Wednesday      A      0.30
6    Pugsley  ZF003    153.14

In [6]:
mask = df.eval('name.isnull() | distance <= 0')
mask

0    False
1    False
2    False
5    False
6    False
dtype: bool

In [7]:
df = df[~mask]
df

        name  plate  distance
0      Gomez   1XZ2      3.70
1   Morticia    NaN      2.10
2     Fester             3.40
5  Wednesday      A      0.30
6    Pugsley  ZF003    153.14